UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32wb5mx_pinmux.h
# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == COMP1_OUT_FUNC           )) ? 12 : \
	((gpio == PA00) && (func == SAI1_EXTCLK_FUNC         )) ? 13 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ? 14 : \
	((gpio == PA00) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PA01) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA01) && (func == LCD_SEG0_FUNC            )) ? 11 : \
	((gpio == PA01) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA02) && (func == RCC_LSCO_FUNC            )) ?  0 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PA02) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PA02) && (func == LCD_SEG1_FUNC            )) ? 11 : \
	((gpio == PA02) && (func == COMP2_OUT_FUNC           )) ? 12 : \
	((gpio == PA02) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == SAI1_CK1_FUNC            )) ?  3 : \
	((gpio == PA03) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PA03) && (func == QUADSPI_CLK_FUNC         )) ? 10 : \
	((gpio == PA03) && (func == LCD_SEG2_FUNC            )) ? 11 : \
	((gpio == PA03) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PA03) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA04) && (func == LCD_SEG5_FUNC            )) ? 11 : \
	((gpio == PA04) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PA04) && (func == LPTIM2_OUT_FUNC          )) ? 14 : \
	((gpio == PA04) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA05) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PA05) && (func == LPTIM2_ETR_FUNC          )) ? 14 : \
	((gpio == PA05) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == LPUART1_CTS_FUNC         )) ?  8 : \
	((gpio == PA06) && (func == QUADSPI_BK1_IO3_FUNC     )) ? 10 : \
	((gpio == PA06) && (func == LCD_SEG3_FUNC            )) ? 11 : \
	((gpio == PA06) && (func == TIM1_BKIN_FUNC           )) ? 12 : \
	((gpio == PA06) && (func == TIM16_CH1_FUNC           )) ? 14 : \
	((gpio == PA06) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA07) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PA07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == QUADSPI_BK1_IO2_FUNC     )) ? 10 : \
	((gpio == PA07) && (func == LCD_SEG4_FUNC            )) ? 11 : \
	((gpio == PA07) && (func == COMP2_OUT_FUNC           )) ? 12 : \
	((gpio == PA07) && (func == TIM17_CH1_FUNC           )) ? 14 : \
	((gpio == PA07) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA08) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PA08) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PA08) && (func == SAI1_CK2_FUNC            )) ?  3 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == LCD_COM0_FUNC            )) ? 11 : \
	((gpio == PA08) && (func == SAI1_SCK_A_FUNC          )) ? 13 : \
	((gpio == PA08) && (func == LPTIM2_OUT_FUNC          )) ? 14 : \
	((gpio == PA08) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA09) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PA09) && (func == SAI1_D2_FUNC             )) ?  3 : \
	((gpio == PA09) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PA09) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PA09) && (func == LCD_COM1_FUNC            )) ? 11 : \
	((gpio == PA09) && (func == SAI1_FS_A_FUNC           )) ? 13 : \
	((gpio == PA09) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA10) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PA10) && (func == SAI1_D1_FUNC             )) ?  3 : \
	((gpio == PA10) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PA10) && (func == CRS_SYNC_FUNC            )) ? 10 : \
	((gpio == PA10) && (func == LCD_COM2_FUNC            )) ? 11 : \
	((gpio == PA10) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PA10) && (func == TIM17_BKIN_FUNC          )) ? 14 : \
	((gpio == PA10) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA11) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PA11) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == USART1_NSS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == USB_DM_FUNC              )) ? 10 : \
	((gpio == PA11) && (func == TIM1_BKIN2_FUNC          )) ? 12 : \
	((gpio == PA11) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA12) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PA12) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA12) && (func == USART1_DE_FUNC           )) ?  7 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PA12) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PA12) && (func == USB_DP_FUNC              )) ? 10 : \
	((gpio == PA12) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA13) && (func == SYS_JTMS_SWDIO_FUNC      )) ?  0 : \
	((gpio == PA13) && (func == IR_OUT_FUNC              )) ?  8 : \
	((gpio == PA13) && (func == USB_NOE_FUNC             )) ? 10 : \
	((gpio == PA13) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PA13) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA14) && (func == SYS_JTCK_SWCLK_FUNC      )) ?  0 : \
	((gpio == PA14) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PA14) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PA14) && (func == LCD_SEG5_FUNC            )) ? 11 : \
	((gpio == PA14) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PA14) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PA15) && (func == SYS_JTDI_FUNC            )) ?  0 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA15) && (func == TSC_G3_IO1_FUNC          )) ?  9 : \
	((gpio == PA15) && (func == LCD_SEG17_FUNC           )) ? 11 : \
	((gpio == PA15) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB00) && (func == RF_TX_MOD_EXT_PA_FUNC    )) ?  6 : \
	((gpio == PB00) && (func == COMP1_OUT_FUNC           )) ? 12 : \
	((gpio == PB00) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB01) && (func == LPUART1_DE_FUNC          )) ?  8 : \
	((gpio == PB01) && (func == LPUART1_RTS_FUNC         )) ?  8 : \
	((gpio == PB01) && (func == LPTIM2_IN1_FUNC          )) ? 14 : \
	((gpio == PB01) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB02) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PB02) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PB02) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PB02) && (func == LCD_VLCD_FUNC            )) ? 11 : \
	((gpio == PB02) && (func == SAI1_EXTCLK_FUNC         )) ? 13 : \
	((gpio == PB02) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB03) && (func == SYS_JTDO_SWO_FUNC        )) ?  0 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PB03) && (func == USART1_DE_FUNC           )) ?  7 : \
	((gpio == PB03) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PB03) && (func == LCD_SEG7_FUNC            )) ? 11 : \
	((gpio == PB03) && (func == SAI1_SCK_B_FUNC          )) ? 13 : \
	((gpio == PB03) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB04) && (func == SYS_JTRST_FUNC           )) ?  0 : \
	((gpio == PB04) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PB04) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PB04) && (func == USART1_NSS_FUNC          )) ?  7 : \
	((gpio == PB04) && (func == TSC_G2_IO1_FUNC          )) ?  9 : \
	((gpio == PB04) && (func == LCD_SEG8_FUNC            )) ? 11 : \
	((gpio == PB04) && (func == SAI1_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PB04) && (func == TIM17_BKIN_FUNC          )) ? 14 : \
	((gpio == PB04) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB05) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PB05) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PB05) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PB05) && (func == TSC_G2_IO2_FUNC          )) ?  9 : \
	((gpio == PB05) && (func == LCD_SEG9_FUNC            )) ? 11 : \
	((gpio == PB05) && (func == COMP2_OUT_FUNC           )) ? 12 : \
	((gpio == PB05) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PB05) && (func == TIM16_BKIN_FUNC          )) ? 14 : \
	((gpio == PB05) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB06) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PB06) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PB06) && (func == TSC_G2_IO3_FUNC          )) ?  9 : \
	((gpio == PB06) && (func == LCD_SEG6_FUNC            )) ? 11 : \
	((gpio == PB06) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PB06) && (func == TIM16_CH1N_FUNC          )) ? 14 : \
	((gpio == PB06) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB07) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PB07) && (func == TIM1_BKIN_FUNC           )) ?  3 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PB07) && (func == TSC_G2_IO4_FUNC          )) ?  9 : \
	((gpio == PB07) && (func == LCD_SEG21_FUNC           )) ? 11 : \
	((gpio == PB07) && (func == TIM17_CH1N_FUNC          )) ? 14 : \
	((gpio == PB07) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB08) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB08) && (func == SAI1_CK1_FUNC            )) ?  3 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB08) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PB08) && (func == LCD_SEG16_FUNC           )) ? 11 : \
	((gpio == PB08) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PB08) && (func == TIM16_CH1_FUNC           )) ? 14 : \
	((gpio == PB08) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB09) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB09) && (func == SAI1_D2_FUNC             )) ?  3 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB09) && (func == IR_OUT_FUNC              )) ?  8 : \
	((gpio == PB09) && (func == TSC_G7_IO4_FUNC          )) ?  9 : \
	((gpio == PB09) && (func == QUADSPI_BK1_IO0_FUNC     )) ? 10 : \
	((gpio == PB09) && (func == LCD_COM3_FUNC            )) ? 11 : \
	((gpio == PB09) && (func == SAI1_FS_A_FUNC           )) ? 13 : \
	((gpio == PB09) && (func == TIM17_CH1_FUNC           )) ? 14 : \
	((gpio == PB09) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PB10) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PB10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PB10) && (func == TSC_SYNC_FUNC            )) ?  9 : \
	((gpio == PB10) && (func == QUADSPI_CLK_FUNC         )) ? 10 : \
	((gpio == PB10) && (func == LCD_SEG10_FUNC           )) ? 11 : \
	((gpio == PB10) && (func == COMP1_OUT_FUNC           )) ? 12 : \
	((gpio == PB10) && (func == SAI1_SCK_A_FUNC          )) ? 13 : \
	((gpio == PB10) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PB11) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PB11) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PB11) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PB11) && (func == LCD_SEG11_FUNC           )) ? 11 : \
	((gpio == PB11) && (func == COMP2_OUT_FUNC           )) ? 12 : \
	((gpio == PB11) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB12) && (func == TIM1_BKIN_FUNC           )) ?  3 : \
	((gpio == PB12) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB12) && (func == LPUART1_DE_FUNC          )) ?  8 : \
	((gpio == PB12) && (func == LPUART1_RTS_FUNC         )) ?  8 : \
	((gpio == PB12) && (func == TSC_G1_IO1_FUNC          )) ?  9 : \
	((gpio == PB12) && (func == LCD_SEG12_FUNC           )) ? 11 : \
	((gpio == PB12) && (func == SAI1_FS_A_FUNC           )) ? 13 : \
	((gpio == PB12) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB13) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PB13) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == LPUART1_CTS_FUNC         )) ?  8 : \
	((gpio == PB13) && (func == TSC_G1_IO2_FUNC          )) ?  9 : \
	((gpio == PB13) && (func == LCD_SEG13_FUNC           )) ? 11 : \
	((gpio == PB13) && (func == SAI1_SCK_A_FUNC          )) ? 13 : \
	((gpio == PB13) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB14) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PB14) && (func == TSC_G1_IO3_FUNC          )) ?  9 : \
	((gpio == PB14) && (func == LCD_SEG14_FUNC           )) ? 11 : \
	((gpio == PB14) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PB14) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PB15) && (func == TSC_G1_IO4_FUNC          )) ?  9 : \
	((gpio == PB15) && (func == LCD_SEG15_FUNC           )) ? 11 : \
	((gpio == PB15) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PB15) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC00) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PC00) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PC00) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PC00) && (func == LCD_SEG18_FUNC           )) ? 11 : \
	((gpio == PC00) && (func == LPTIM2_IN1_FUNC          )) ? 14 : \
	((gpio == PC00) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC01) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PC01) && (func == SPI2_MOSI_FUNC           )) ?  3 : \
	((gpio == PC01) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PC01) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PC01) && (func == LCD_SEG19_FUNC           )) ? 11 : \
	((gpio == PC01) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC02) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PC02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PC02) && (func == LCD_SEG20_FUNC           )) ? 11 : \
	((gpio == PC02) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC03) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PC03) && (func == SAI1_D1_FUNC             )) ?  3 : \
	((gpio == PC03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PC03) && (func == LCD_VLCD_FUNC            )) ? 11 : \
	((gpio == PC03) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PC03) && (func == LPTIM2_ETR_FUNC          )) ? 14 : \
	((gpio == PC03) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC04) && (func == LCD_SEG22_FUNC           )) ? 11 : \
	((gpio == PC04) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC05) && (func == SAI1_D3_FUNC             )) ?  3 : \
	((gpio == PC05) && (func == LCD_SEG23_FUNC           )) ? 11 : \
	((gpio == PC05) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC06) && (func == TSC_G4_IO1_FUNC          )) ?  9 : \
	((gpio == PC06) && (func == LCD_SEG24_FUNC           )) ? 11 : \
	((gpio == PC06) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC07) && (func == TSC_G4_IO2_FUNC          )) ?  9 : \
	((gpio == PC07) && (func == LCD_SEG25_FUNC           )) ? 11 : \
	((gpio == PC07) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC08) && (func == TSC_G4_IO3_FUNC          )) ?  9 : \
	((gpio == PC08) && (func == LCD_SEG26_FUNC           )) ? 11 : \
	((gpio == PC08) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC09) && (func == TIM1_BKIN_FUNC           )) ?  3 : \
	((gpio == PC09) && (func == TSC_G4_IO4_FUNC          )) ?  9 : \
	((gpio == PC09) && (func == USB_NOE_FUNC             )) ? 10 : \
	((gpio == PC09) && (func == LCD_SEG27_FUNC           )) ? 11 : \
	((gpio == PC09) && (func == SAI1_SCK_B_FUNC          )) ? 13 : \
	((gpio == PC09) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC10) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PC10) && (func == TSC_G3_IO2_FUNC          )) ?  9 : \
	((gpio == PC10) && (func == LCD_COM4_FUNC            )) ? 11 : \
	((gpio == PC10) && (func == LCD_SEG28_FUNC           )) ? 11 : \
	((gpio == PC10) && (func == LCD_SEG40_FUNC           )) ? 11 : \
	((gpio == PC10) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC11) && (func == TSC_G3_IO3_FUNC          )) ?  9 : \
	((gpio == PC11) && (func == LCD_COM5_FUNC            )) ? 11 : \
	((gpio == PC11) && (func == LCD_SEG29_FUNC           )) ? 11 : \
	((gpio == PC11) && (func == LCD_SEG41_FUNC           )) ? 11 : \
	((gpio == PC11) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC12) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PC12) && (func == RCC_LSCO_FUNC            )) ?  6 : \
	((gpio == PC12) && (func == TSC_G3_IO4_FUNC          )) ?  9 : \
	((gpio == PC12) && (func == LCD_COM6_FUNC            )) ? 11 : \
	((gpio == PC12) && (func == LCD_SEG30_FUNC           )) ? 11 : \
	((gpio == PC12) && (func == LCD_SEG42_FUNC           )) ? 11 : \
	((gpio == PC12) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC13) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC14) && (func == RF_DTB0_FUNC             )) ?  6 : \
	((gpio == PC14) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PC15) && (func == RF_DTB1_FUNC             )) ?  6 : \
	((gpio == PC15) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PD00) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PD01) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD02) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PD02) && (func == TSC_SYNC_FUNC            )) ?  9 : \
	((gpio == PD02) && (func == LCD_COM7_FUNC            )) ? 11 : \
	((gpio == PD02) && (func == LCD_SEG31_FUNC           )) ? 11 : \
	((gpio == PD02) && (func == LCD_SEG43_FUNC           )) ? 11 : \
	((gpio == PD02) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD03) && (func == SPI2_SCK_FUNC            )) ?  3 : \
	((gpio == PD03) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PD03) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PD03) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD04) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PD04) && (func == TSC_G5_IO1_FUNC          )) ?  9 : \
	((gpio == PD04) && (func == QUADSPI_BK1_IO0_FUNC     )) ? 10 : \
	((gpio == PD04) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD05) && (func == TSC_G5_IO2_FUNC          )) ?  9 : \
	((gpio == PD05) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PD05) && (func == SAI1_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PD05) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD06) && (func == SAI1_D1_FUNC             )) ?  3 : \
	((gpio == PD06) && (func == TSC_G5_IO3_FUNC          )) ?  9 : \
	((gpio == PD06) && (func == QUADSPI_BK1_IO2_FUNC     )) ? 10 : \
	((gpio == PD06) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PD06) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD07) && (func == TSC_G5_IO4_FUNC          )) ?  9 : \
	((gpio == PD07) && (func == QUADSPI_BK1_IO3_FUNC     )) ? 10 : \
	((gpio == PD07) && (func == LCD_SEG39_FUNC           )) ? 11 : \
	((gpio == PD07) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD08) && (func == TIM1_BKIN2_FUNC          )) ?  2 : \
	((gpio == PD08) && (func == LCD_SEG28_FUNC           )) ? 11 : \
	((gpio == PD08) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD09) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PD09) && (func == LCD_SEG29_FUNC           )) ? 11 : \
	((gpio == PD09) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD10) && (func == TRIG_INOUT_FUNC          )) ?  0 : \
	((gpio == PD10) && (func == TSC_G6_IO1_FUNC          )) ?  9 : \
	((gpio == PD10) && (func == LCD_SEG30_FUNC           )) ? 11 : \
	((gpio == PD10) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD11) && (func == TSC_G6_IO2_FUNC          )) ?  9 : \
	((gpio == PD11) && (func == LCD_SEG31_FUNC           )) ? 11 : \
	((gpio == PD11) && (func == LPTIM2_ETR_FUNC          )) ? 14 : \
	((gpio == PD11) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD12) && (func == TSC_G6_IO3_FUNC          )) ?  9 : \
	((gpio == PD12) && (func == LCD_SEG32_FUNC           )) ? 11 : \
	((gpio == PD12) && (func == LPTIM2_IN1_FUNC          )) ? 14 : \
	((gpio == PD12) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD13) && (func == TSC_G6_IO4_FUNC          )) ?  9 : \
	((gpio == PD13) && (func == LCD_SEG33_FUNC           )) ? 11 : \
	((gpio == PD13) && (func == LPTIM2_OUT_FUNC          )) ? 14 : \
	((gpio == PD13) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD14) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PD14) && (func == LCD_SEG34_FUNC           )) ? 11 : \
	((gpio == PD14) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PD15) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PD15) && (func == LCD_SEG35_FUNC           )) ? 11 : \
	((gpio == PD15) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PE00) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PE00) && (func == TSC_G7_IO3_FUNC          )) ?  9 : \
	((gpio == PE00) && (func == LCD_SEG36_FUNC           )) ? 11 : \
	((gpio == PE00) && (func == TIM16_CH1_FUNC           )) ? 14 : \
